benchmarks/results/spike-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/allanflavio/Documents/projects/PERSONAL/backend-challenges/supportnest-rails-saas/benchmarks/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 1m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 01/20 VUs, 3 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m00.8s/1m00.0s

running (0m03.0s), 01/20 VUs, 10 complete and 0 interrupted iterations
default   [   3% ] 01/20 VUs  0m01.8s/1m00.0s

running (0m04.0s), 01/20 VUs, 17 complete and 0 interrupted iterations
default   [   5% ] 01/20 VUs  0m02.8s/1m00.0s

running (0m05.0s), 01/20 VUs, 24 complete and 0 interrupted iterations
default   [   6% ] 01/20 VUs  0m03.8s/1m00.0s

running (0m06.0s), 01/20 VUs, 28 complete and 0 interrupted iterations
default   [   8% ] 01/20 VUs  0m04.8s/1m00.0s

running (0m07.0s), 01/20 VUs, 35 complete and 0 interrupted iterations
default   [  10% ] 01/20 VUs  0m05.8s/1m00.0s

running (0m08.0s), 01/20 VUs, 43 complete and 0 interrupted iterations
default   [  11% ] 01/20 VUs  0m06.8s/1m00.0s

running (0m09.0s), 01/20 VUs, 51 complete and 0 interrupted iterations
default   [  13% ] 01/20 VUs  0m07.8s/1m00.0s

running (0m10.0s), 01/20 VUs, 58 complete and 0 interrupted iterations
default   [  15% ] 01/20 VUs  0m08.8s/1m00.0s

running (0m11.0s), 01/20 VUs, 65 complete and 0 interrupted iterations
default   [  16% ] 01/20 VUs  0m09.8s/1m00.0s

running (0m12.0s), 02/20 VUs, 75 complete and 0 interrupted iterations
default   [  18% ] 02/20 VUs  0m10.8s/1m00.0s

running (0m13.0s), 04/20 VUs, 94 complete and 0 interrupted iterations
default   [  20% ] 04/20 VUs  0m11.8s/1m00.0s

running (0m14.0s), 06/20 VUs, 117 complete and 0 interrupted iterations
default   [  21% ] 06/20 VUs  0m12.8s/1m00.0s

running (0m15.0s), 08/20 VUs, 156 complete and 0 interrupted iterations
default   [  23% ] 08/20 VUs  0m13.8s/1m00.0s

running (0m16.0s), 10/20 VUs, 216 complete and 0 interrupted iterations
default   [  25% ] 10/20 VUs  0m14.8s/1m00.0s

running (0m17.0s), 12/20 VUs, 292 complete and 0 interrupted iterations
default   [  26% ] 12/20 VUs  0m15.8s/1m00.0s

running (0m18.0s), 13/20 VUs, 386 complete and 0 interrupted iterations
default   [  28% ] 13/20 VUs  0m16.8s/1m00.0s

running (0m19.0s), 15/20 VUs, 492 complete and 0 interrupted iterations
default   [  30% ] 15/20 VUs  0m17.8s/1m00.0s

running (0m20.0s), 17/20 VUs, 590 complete and 0 interrupted iterations
default   [  31% ] 17/20 VUs  0m18.8s/1m00.0s

running (0m21.0s), 19/20 VUs, 721 complete and 0 interrupted iterations
default   [  33% ] 19/20 VUs  0m19.8s/1m00.0s

running (0m22.0s), 20/20 VUs, 847 complete and 0 interrupted iterations
default   [  35% ] 20/20 VUs  0m20.8s/1m00.0s

running (0m23.0s), 20/20 VUs, 930 complete and 0 interrupted iterations
default   [  36% ] 20/20 VUs  0m21.8s/1m00.0s

running (0m24.0s), 20/20 VUs, 1025 complete and 0 interrupted iterations
default   [  38% ] 20/20 VUs  0m22.8s/1m00.0s

running (0m25.0s), 20/20 VUs, 1141 complete and 0 interrupted iterations
default   [  40% ] 20/20 VUs  0m23.8s/1m00.0s

running (0m26.0s), 20/20 VUs, 1247 complete and 0 interrupted iterations
default   [  41% ] 20/20 VUs  0m24.8s/1m00.0s

running (0m27.0s), 20/20 VUs, 1368 complete and 0 interrupted iterations
default   [  43% ] 20/20 VUs  0m25.8s/1m00.0s

running (0m28.0s), 20/20 VUs, 1450 complete and 0 interrupted iterations
default   [  45% ] 20/20 VUs  0m26.8s/1m00.0s

running (0m29.0s), 20/20 VUs, 1543 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  0m27.8s/1m00.0s

running (0m30.0s), 20/20 VUs, 1656 complete and 0 interrupted iterations
default   [  48% ] 20/20 VUs  0m28.8s/1m00.0s

running (0m31.0s), 20/20 VUs, 1773 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  0m29.8s/1m00.0s

running (0m32.0s), 20/20 VUs, 1883 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  0m30.8s/1m00.0s

running (0m33.0s), 20/20 VUs, 1987 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  0m31.8s/1m00.0s

running (0m34.0s), 20/20 VUs, 2109 complete and 0 interrupted iterations
default   [  55% ] 20/20 VUs  0m32.8s/1m00.0s

running (0m35.0s), 20/20 VUs, 2244 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  0m33.8s/1m00.0s

running (0m36.0s), 20/20 VUs, 2391 complete and 0 interrupted iterations
default   [  58% ] 20/20 VUs  0m34.8s/1m00.0s

running (0m37.0s), 20/20 VUs, 2504 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  0m35.8s/1m00.0s

running (0m38.0s), 20/20 VUs, 2628 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  0m36.8s/1m00.0s

running (0m39.0s), 20/20 VUs, 2775 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  0m37.8s/1m00.0s

running (0m40.0s), 20/20 VUs, 2915 complete and 0 interrupted iterations
default   [  65% ] 20/20 VUs  0m38.8s/1m00.0s

running (0m41.0s), 20/20 VUs, 3028 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  0m39.8s/1m00.0s

running (0m42.0s), 19/20 VUs, 3140 complete and 0 interrupted iterations
default   [  68% ] 19/20 VUs  0m40.8s/1m00.0s

running (0m43.0s), 17/20 VUs, 3235 complete and 0 interrupted iterations
default   [  70% ] 17/20 VUs  0m41.8s/1m00.0s

running (0m44.0s), 15/20 VUs, 3329 complete and 0 interrupted iterations
default   [  71% ] 15/20 VUs  0m42.8s/1m00.0s

running (0m45.0s), 13/20 VUs, 3425 complete and 0 interrupted iterations
default   [  73% ] 13/20 VUs  0m43.8s/1m00.0s

running (0m46.0s), 11/20 VUs, 3507 complete and 0 interrupted iterations
default   [  75% ] 11/20 VUs  0m44.8s/1m00.0s

running (0m47.0s), 10/20 VUs, 3591 complete and 0 interrupted iterations
default   [  76% ] 10/20 VUs  0m45.8s/1m00.0s

running (0m48.0s), 08/20 VUs, 3657 complete and 0 interrupted iterations
default   [  78% ] 08/20 VUs  0m46.8s/1m00.0s

running (0m49.0s), 06/20 VUs, 3706 complete and 0 interrupted iterations
default   [  80% ] 06/20 VUs  0m47.8s/1m00.0s

running (0m50.0s), 04/20 VUs, 3741 complete and 0 interrupted iterations
default   [  81% ] 04/20 VUs  0m48.8s/1m00.0s

running (0m51.0s), 02/20 VUs, 3763 complete and 0 interrupted iterations
default   [  83% ] 02/20 VUs  0m49.8s/1m00.0s

running (0m52.0s), 01/20 VUs, 3772 complete and 0 interrupted iterations
default   [  85% ] 01/20 VUs  0m50.8s/1m00.0s

running (0m53.0s), 01/20 VUs, 3779 complete and 0 interrupted iterations
default   [  86% ] 01/20 VUs  0m51.8s/1m00.0s

running (0m54.0s), 01/20 VUs, 3788 complete and 0 interrupted iterations
default   [  88% ] 01/20 VUs  0m52.8s/1m00.0s

running (0m55.0s), 01/20 VUs, 3795 complete and 0 interrupted iterations
default   [  90% ] 01/20 VUs  0m53.8s/1m00.0s

running (0m56.0s), 01/20 VUs, 3802 complete and 0 interrupted iterations
default   [  91% ] 01/20 VUs  0m54.8s/1m00.0s

running (0m57.0s), 01/20 VUs, 3810 complete and 0 interrupted iterations
default   [  93% ] 01/20 VUs  0m55.8s/1m00.0s

running (0m58.0s), 01/20 VUs, 3816 complete and 0 interrupted iterations
default   [  95% ] 01/20 VUs  0m56.8s/1m00.0s

running (0m59.0s), 01/20 VUs, 3822 complete and 0 interrupted iterations
default   [  96% ] 01/20 VUs  0m57.8s/1m00.0s

running (1m00.0s), 01/20 VUs, 3830 complete and 0 interrupted iterations
default   [  98% ] 01/20 VUs  0m58.8s/1m00.0s

running (1m01.0s), 01/20 VUs, 3838 complete and 0 interrupted iterations
default   [ 100% ] 01/20 VUs  0m59.8s/1m00.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3842    62.655556/s
    checks_succeeded...: 100.00% 3842 out of 3842
    checks_failed......: 0.00%   0 out of 3842

    ✓ bootstrap returns 201
    ✓ seed ticket returns 201
    ✓ ticket create returns 201
    ✓ ticket read returns 200
    ✓ organization read returns 200

    HTTP
    http_req_duration..............: avg=64ms     min=5.6ms   med=49.4ms   max=847.29ms p(90)=126.12ms p(95)=164.89ms p(99)=258.02ms
      { expected_response:true }...: avg=64ms     min=5.6ms   med=49.4ms   max=847.29ms p(90)=126.12ms p(95)=164.89ms p(99)=258.02ms
    http_req_failed................: 0.00%  0 out of 3842
    http_reqs......................: 3842   62.655556/s

    EXECUTION
    iteration_duration.............: avg=164.38ms min=105.8ms med=149.99ms max=535.52ms p(90)=226.56ms p(95)=264.51ms p(99)=356ms   
    iterations.....................: 3840   62.62294/s
    vus............................: 1      min=0         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 4.6 MB 75 kB/s
    data_sent......................: 1.2 MB 19 kB/s



running (1m01.3s), 00/20 VUs, 3840 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  1m0s